{
  "slug": "my-home-office-setup-upgrades",
  "title": "My Home Office Setup & Upgrades",
  "description": "My Home Office",
  "date": "2021-01-05T12:17:13Z",
  "modified": "2025-10-01T15:22:15Z",
  "author": "James Kilby",
  "url": "https://jameskilby.co.uk/2021/01/my-home-office-setup-upgrades/",
  "markdown_url": "/markdown/posts/my-home-office-setup-upgrades.md",
  "api_url": "/api/posts/my-home-office-setup-upgrades.json",
  "categories": [
    "Personal",
    "Consulting",
    "Nutanix",
    "Devops",
    "VMware",
    "AWS",
    "Hosting",
    "Cloudflare",
    "Wordpress"
  ],
  "tags": [
    null,
    null,
    null
  ],
  "image": "https://jameskilby.co.uk/wp-content/uploads/2023/05/IMG_7017-scaled-1-1024x768.jpeg",
  "content": "![](https://jameskilby.co.uk/wp-content/uploads/2023/05/IMG_7017-scaled-1.jpeg)\n\n[Personal](https://jameskilby.co.uk/category/personal/) | [Consulting](https://jameskilby.co.uk/category/consulting/)\n\n# My Home Office Setup & Upgrades\n\nBy[James](https://jameskilby.co.uk) January 5, 2021October 1, 2025 • 📖8 min read(1,568 words)\n\n📅 **Published:** January 05, 2021• **Updated:** October 01, 2025\n\nGiven the year that was 2020 and at the time of writing a distinct improvement appears a long way off I decided it was time to up my homeworking game. I bought a beautiful Dell 49″ monitor back in mid-2020 that has been the central focus of my home office. With this setup I always had my trusty Macbook Air shut as I have no need for any more screen estate. This caused some challenges for video calls with the ever-present Zoom/Teams as the webcam I was using was no longer available. \n\nI tried a few options to improve this but they were all a bit suboptimal. I decided to do a few drastic upgrades over the last month or so. This post is to show exactly what I’m running as of January 2021.\n\nA few people have asked me exactly how I have my desk setup so this is an exhaustive list of everything on my desk, however, not everything is a recent purchase. \n\nI’ll start with the BOM. I have attached a link to where they can be obtained (If its an Amazon link it will be an affiliate link) and the price I paid. If the exact item is no longer produced the link will go to an equivalent. I won’t go into detail on every component but if you have any questions please ask.\n\n## Bill of Materials\n\nItem | Cost £| Link  \n---|---|---  \nStanding Desk | 500 | [Ikea](https://www.ikea.com/gb/en/p/idasen-desk-sit-stand-brown-beige-s89280969/)  \nHeadphone Stand | 22.90 | [Amazon](https://amzn.to/2XQYvsp)  \nLaptop Stand | 19.99 | [Amazon](https://amzn.to/2XPNVli)  \nApple Macbook Air 2018 13″ | 1779 | [Apple](https://www.apple.com/uk/shop/buy-mac/macbook-air)  \nApple iPad Pro 9.7″ | 599.39 | [Apple](https://www.apple.com/uk/shop/buy-ipad/ipad-pro)  \nApple Pencil  | 99.99 | [Amazon](https://amzn.to/2Kd0vYC)  \nDell 49″ Monitor | 1100 | [Dell](https://www.dell.com/en-uk/shop/dell-ultrasharp-49-curved-monitor-u4919dw/apd/210-argk/monitors-monitor-accessories)  \nErgotron MX | 119.76 | [Amazon](https://amzn.to/2Lz46RI)  \nElgato Ring Light | 189.95 | [Amazon](https://amzn.to/38PI0mM)  \nCanon EOS 5D Mk IV | 2799 | [Amazon](https://amzn.to/39J1jgx)  \nCanon 17-40MM F4 Lens + Hoya UV Filter | 573 | [Amazon](https://amzn.to/38PI0mM)  \nBlackmagic Design Atem Mini | 303 | [Amazon](https://amzn.to/38PI0mM)  \nShure MV7 + Stand | 289 | [Amazon](https://amzn.to/2KHOvPf)  \nAnker USB-C Charger | 29.99 | [Amazon](https://amzn.to/3iE2LoC)  \nAmazon Echo Show 5 | 29.99 | [Amazon](https://amzn.to/2Kd0vYC)  \nYubikey 4 | 39.99 | [Amazon](https://amzn.to/3ifPHp7)  \nBeats Solo Pro* | 169.99 | [Amazon](https://amzn.to/3qwVsC2)  \nKnobsound Amp | 41.99 | [Amazon](https://amzn.to/3sByXxx)  \nAssorted Cables | 100 | N/A  \n**Total** | **8306.93** |   \n  \n## Desk – Ikea Idasen Sit/Stand 160\n\nThe desk is the focal point of a home office and therefore it’s an important choice. I decided a while ago to go for a standing desk and I also prefer having a wide desk so I got the 1.6M wide Ikea Idasen desk and its awesome. I don’t stand as often as I possibly should but its something I do everyday.\n\nThe choice of a standing desk makes everything else a bit harder as everything needs to move with the desk while remaining stable. It also means you need to be careful with cable length’s and mounting things. I have 3 cables running to the desk. A single power lead and two Cat 5e’s one for my Macbook Air and one for my Atem Mini. \n\n![](https://jameskilby.co.uk/wp-content/uploads/2023/05/IMG_7017-scaled-1-1024x768.jpeg)Desk Setup\n\n## Monitor – Dell UltraSharp 49 Curved U4919DW\n\nThe Monitor dominates my entire view and its huge, no other way to describe it. Its the equivalent of 2×27″ Monitors sat side by side and runs in 5120 x 1440 at 60 Hz. My Mac is connected via USB-C This helps in reducing the cables on the desk. The Monitor offers a number of USB ports which offer a convenient place to plug my Yubikey as my Mac is placed out of reach. The Monitor has the typical inputs you expect and has a nice picture in picture feature that I sometimes utilise with the Atem Mini. The Atem outputs via HDMI as well as USB-C and I utilise this to check the preview output that will be viewed. \n\n## Monitor Arm – Ergotron MX \n\nThe Dell Monitor does come with an included stand but It took up a large footprint on my desk. Due to the size and weight of the Dell U4919DW (The Screen is 11.4KG), it heavily limited the choice of stands that were suitable. \n\nI settled on the MX from Ergotron and its perfect. The springs did need tightening to accommodate the weight but once that was done it holds the screen where it’s set. (I slightly change the position depending on if I’m standing or sitting at the desk.)\n\n## Camera – Canon EOS 5D MkIV\n\nI have had a variety of Canon SLR’s over the last 14 years and the 5D is certainly the best, It is an exceptional piece of kit. It offers a number of key features that I can utilise. One of the advantages is that it has a clean HDMI output. This is fed directly into the Atem Mini. It has excellent focus capabilities using the Dual Pixel CMOS and this combined with AF subject tracking allows me to always be in focus.\n\n![](https://jameskilby.co.uk/wp-content/uploads/2023/05/IMG_7021-scaled-1-1-1024x768.jpeg)\n\nThe 5D also has WIFI control capabilities allowing me to both preview or amend any of the settings from an app on my iPhone. This is useful for amending the audio gain or exposure options if needed. This is a bit of a pain to do without the app so its a big advantage. Coupled to the front of the 5D I have a Canon 17-40 F4 L lens. I tend to have this wide open to throw the background out of focus a bit. \n\nA sample image is below.\n\n![](https://jameskilby.co.uk/wp-content/uploads/2023/05/Screenshot-2021-01-15-at-00.09.45-1024x567.png)\n\n## Lighting – Elgato Ring Light\n\nThe Canon 5D is mounted in the centre of an Elgato Ring light. This is clipped to the back of the centre of my desk. I have it set to 5700K in the above picture which seems to be the colour temperature that’s most neutral. A picture of what it looks like from my point of view is below.\n\n![](https://jameskilby.co.uk/wp-content/uploads/2023/05/IMG_7021-scaled-1-1024x768.jpeg)\n\n## Sound – Shure MV7\n\n![](https://jameskilby.co.uk/wp-content/uploads/2023/05/IMG_7023-scaled-1-1024x768.jpeg)\n\nShure are probably the most famous name in microphones, the MV7 is a slight departure from the professional-grade microphones like the SM58 that they are famous for. This is because the MV7 is a dual output mic with a USB-C as well as a standard XLR output. It’s also capable of outputting to both at the same time. This gives me the flexibility of recording directly to my Macbook if needed or my prefered route into the 5D. This is prefered as it removes any possible sync issues between audio and video plus has the added benefit of being capable of being recording within the 5D as well as on my Macbook via the ATEM.\n\n## Video – Blackmagic Design Atem Mini\n\n![](https://jameskilby.co.uk/wp-content/uploads/2023/05/IMG_7022-scaled-1-1024x768.jpeg)\n\nThe ATEM Mini is the centrepiece of the media part of my setup. It controls all of the inputs and outputs. Although its the most basic in the ATEM range its got a pretty advanced feature set. It has 4 HDMI inputs and I typically use 3 of these. They are for the 5D, Macbook Air and iPad Pro. The mixer then has two distinct outputs. One is HDMI and the other is USB-C which is plugged back into my Mac. The connection into the Mac signals as a USB Webcam. This makes it easy to use in any application. It also does a very neat trick that John Nicholson pointed out to me. As well as pretending to be a webcam it also shows up as an external monitor. Where this becomes insanely useful is for apps like PowerPoint. Powerpoint detects the second monitor and presents the full screen to the Mini that the audience see. But I retain the presenter view on-screen with presenter notes timings etc. \n\n![](https://jameskilby.co.uk/wp-content/uploads/2023/05/Screenshot-2021-01-15-at-02.06.47.png)\n\nThe ATEM also has upstream and downstream capabilities, allowing for the mixing of multiple video screens.\n\nThe example here is taking this presentation being run from my iPad and overlaying it over the Camera input. I will do a separate post with some info on how It was put together and add some audio.\n\n<https://youtu.be/feMFZbnH00w>\n\nIf you have read this far and you have been paying attention you may have noticed that a Mac Mini has appeared on my desk. \n\nYes, I snuck in one of the new M1 arm based Mac’s. I must say I have been blown away by the performance of it. I decided to go for the 8GB of Ram with 512GB disk option after watching a number of YouTube videos. So far it has been able to handle everything I have been throwing at it with ease.\n\nI will do a separate post concentrating on the M1 once I have lived with it for a bit longer. One feature that appears not to work is the ATEM mini dual display described above. Further investigation is required.\n\n## Future purchases\n\n### Elgato Streamdeck\n\nA lot of people have these and its something I would strongly consider. I purchased the software version and run this on my Ipad pro. I think this was a sensible thing to do to see how it can be used with the various integrations and although it’s a simple concept I have been very happy with it and will likely upgrade to a hardware version at some point.\n\n### Herman Miller Aeron\n\nWhen travel was a thing I was lucky enough to visit a number of customers in the high tech/financial industry. This allowed me to “sample” a number of quality seats. The best of which has to be the Aeron. It has an amazing reputation and a large price tag to go with it. So, for now, it’s just on the wish list.\n\n*The Beats Solo’s were a gift as part of the Veeam Vanguard Program. I didn’t purchase these with my own money.\n\n## 📚 Related Posts\n\n  * [Analytics in a privacy focused world](https://jameskilby.co.uk/2023/11/analytics-in-a-privacy-focused-world/)\n  * [Advanced Deploy VMware vSphere 7.x 3V0-22.21N](https://jameskilby.co.uk/2023/11/advanced-deploy-vmware-vsphere-7-x-3v0-22-21n/)\n  * [VMware &#8211; Going out with a Bang!](https://jameskilby.co.uk/2023/10/going-out-with-a-bang/)\n\n## Similar Posts\n\n  * [ ![Nutanix NCP](https://jameskilby.co.uk/wp-content/uploads/2020/07/nutanix-logo-HI-REZ_reverse-w-carrier-768x196.jpg) ](https://jameskilby.co.uk/2020/07/nutanix-ncp/)\n\n[Nutanix](https://jameskilby.co.uk/category/nutanix/) | [Personal](https://jameskilby.co.uk/category/personal/)\n\n### [Nutanix NCP](https://jameskilby.co.uk/2020/07/nutanix-ncp/)\n\nBy[James](https://jameskilby.co.uk) July 2, 2020July 10, 2024\n\nI saw a tweet a couple of weeks ago mentioning that Nutanix were offering a free go at the Nutanix Certified Professional exam. They are also offering free on-demand training to go with it. In my current role, I haven’t used Nutanix however I have good experience using it as the storage platform with vSphere…\n\n  * [ ![My First Pull](https://jameskilby.co.uk/wp-content/uploads/2020/12/175jvBleoQfAZJc3sgTSPQA.jpg) ](https://jameskilby.co.uk/2020/12/my-first-pull/)\n\n[Devops](https://jameskilby.co.uk/category/devops/) | [Personal](https://jameskilby.co.uk/category/personal/)\n\n### [My First Pull](https://jameskilby.co.uk/2020/12/my-first-pull/)\n\nBy[James](https://jameskilby.co.uk) December 22, 2020December 8, 2025\n\nI was initially going to add in the contents of this post to one that I have been writing about my exploits with HashiCorp Packer but I decided it probably warranted being separated out. While working with the following awesome project I noticed a couple of minor errors and Improvements that I wanted to suggest….\n\n  * [ ![VMware Certified Master Specialist HCI 2020](https://jameskilby.co.uk/wp-content/uploads/2020/09/vmware_SP_HCI20.png) ](https://jameskilby.co.uk/2020/09/vmware-certified-master-specialist-hci-2020/)\n\n[Personal](https://jameskilby.co.uk/category/personal/) | [VMware](https://jameskilby.co.uk/category/vmware/)\n\n### [VMware Certified Master Specialist HCI 2020](https://jameskilby.co.uk/2020/09/vmware-certified-master-specialist-hci-2020/)\n\nBy[James](https://jameskilby.co.uk) September 13, 2020November 11, 2023\n\nI recently sat (and passed the VMware HCI Master Specialist exam (5V0-21.20). I won’t go into any details of the contents but I will comment that I felt the questions were fair and that there wasn’t anything in it to trip you up. The required knowledge was certainly wider than the vSAN specialist exam. This…\n\n  * [ ![AWS Solution Architect – Associate](https://jameskilby.co.uk/wp-content/uploads/2018/05/AmazonWebservices_Logo.svg_-768x307.png) ](https://jameskilby.co.uk/2019/12/aws-solution-architect-associate/)\n\n[AWS](https://jameskilby.co.uk/category/aws/) | [Personal](https://jameskilby.co.uk/category/personal/)\n\n### [AWS Solution Architect – Associate](https://jameskilby.co.uk/2019/12/aws-solution-architect-associate/)\n\nBy[James](https://jameskilby.co.uk) December 16, 2019December 4, 2025\n\nToday was a good day. I renewed my AWS Solution Architect certification. Although my work is primarily in and around the VMware ecosystem I have been working a lot with VMware Cloud on AWS recently with a number of our customers. Having a good foundation of the core AWS services has…\n\n  * [ ![And now for something completely different](https://jameskilby.co.uk/wp-content/uploads/2018/10/fWbXybA7-768x193.png) ](https://jameskilby.co.uk/2018/10/and-now-for-something-completely-different/)\n\n[Personal](https://jameskilby.co.uk/category/personal/)\n\n### [And now for something completely different](https://jameskilby.co.uk/2018/10/and-now-for-something-completely-different/)\n\nBy[James](https://jameskilby.co.uk) October 16, 2018July 10, 2024\n\nI have worked for my current employer Zen Internet for 3.5 years. Over that time I have changed roles from what was originally a customer-focused role into a role with one of the core platform teams. This has meant looking after the majority of the Internal and customer Virtual platforms. During this time Zen has undergone…\n\n  * [ ![Web Development](https://jameskilby.co.uk/wp-content/uploads/2020/06/iu-2-768x229.png) ](https://jameskilby.co.uk/2022/01/web-development/)\n\n[Hosting](https://jameskilby.co.uk/category/hosting/) | [Cloudflare](https://jameskilby.co.uk/category/cloudflare/) | [Personal](https://jameskilby.co.uk/category/personal/) | [Wordpress](https://jameskilby.co.uk/category/wordpress/)\n\n### [Web Development](https://jameskilby.co.uk/2022/01/web-development/)\n\nBy[James](https://jameskilby.co.uk) January 4, 2022October 1, 2025\n\nA while ago I started messing with Cloudflare Workers. I have now moved this site permanently over to them. This is partly related to some issues I have been having with internet access at home. Prior to this, the site ran from within my lab. This means the site is now super fast (hopefully :p)….",
  "excerpt": "![](https://jameskilby.co.uk/wp-content/uploads/2023/05/IMG_7017-scaled-1.jpeg)\n\n[Personal](https://jameskilby.co.uk/category/personal/) | [Consulting](https://jameskilby.co.uk/category/consulting/)\n\n# My Home Office Setup & Upgrades\n\nBy[James](https://jameskilby.co.uk) January 5, 2021October 1, 202..."
}