{
  "slug": "web-development-improvements",
  "title": "Web Development Improvements",
  "description": "I have spent the Christmas break making some improvements to this blog. A lot of these are in \"the backend\" These help improve the performance, Privacy, SEO,",
  "date": "2026-01-15T15:12:16Z",
  "modified": "2026-01-17T08:47:32Z",
  "author": "James Kilby",
  "url": "https://jameskilby.co.uk/2026/01/web-development-improvements/",
  "markdown_url": "/markdown/posts/web-development-improvements.md",
  "api_url": "/api/posts/web-development-improvements.json",
  "categories": [
    "Cloudflare",
    "Hosting",
    "Wordpress",
    "Artificial Intelligence",
    "Docker",
    "Personal"
  ],
  "tags": [
    null,
    null,
    null,
    null
  ],
  "image": "https://jameskilby.co.uk/wp-content/uploads/2026/01/Website-Optimisations.png",
  "content": "![](https://jameskilby.co.uk/wp-content/uploads/2026/01/Website-Optimisations.png)\n\n[Cloudflare](https://jameskilby.co.uk/category/cloudflare/) | [Hosting](https://jameskilby.co.uk/category/hosting/) | [Wordpress](https://jameskilby.co.uk/category/wordpress/)\n\n# Web Development Improvements\n\nBy[James](https://jameskilby.co.uk) January 15, 2026January 17, 2026 • 📖8 min read(1,598 words)\n\n📅 **Published:** January 15, 2026• **Updated:** January 17, 2026\n\nI have spent the Christmas break making some improvements to this blog. A lot of these are in “the backend” These help improve the performance, Privacy, SEO, and I have also added some security best practices.\n\nMost of these changes were done more as an exercise than due to a specific requirement. I also had a HUGE amount of help with some of these steps from a variety of AI tools. However [Warp](https://jameskilby.co.uk/2025/04/warp-the-intelligent-terminal/) did the bulk of the heavy lifting. The repo behind the content of this site as well as the implementation is [public](https://github.com/jameskilbynet/jkcoukblog) in case you want to look deeper/steal anything.\n\nBefore we dig into the details it’s probably worth briefly summarising what is going on.\n\n![](https://jameskilby.co.uk/wp-content/uploads/2025/10/Wordpress-Authoring-2-1024x677.png)\n\n## Solution Overview\n\nBelow is a condensed view of what the GitHub runner does.\n\n  * Connect to WordPress REST API \n  * Discover all posts, pages, categories, and tags\n  * Downloads the relevant HTML, CSS, JS, images, and fonts\n  * Replaces WordPress URLs from my authoring instance “WordPress.jameskilby.cloud” to the live site jameskilby.co.uk\n  * Processes WordPress embeds (Acast, YouTube, Vimeo, Twitter) as seen on the media page.\n  * Injects Plausible Analytics tracking code\n  * Corrects the theme\n  * Generates sitemap and redirects file\n\n## Table of Contents\n\n## Performance\n\nI have split the performance section into two main components. The first is around making the public site faster. This is a critical component. I want the site to be fast for me and others. It obviously helps with site rankings as well. It was also an exercise in improving my understanding of web development and relevant optimisations.\n\n### Measure Site Performance with Lighthouse\n\nTo understand site performance, first you need to measure it. There are great tools like Gtmetrix.com that will generate a [report](https://gtmetrix.com/reports/jameskilby.co.uk/ADjhUqtL/) on your site performance. \n\nI decided to take this a step further. I have deployed a GitHub action that watches commits to the underlying repo. When anything changes in the public directory (i.e. the public facing website) the action is triggered. This action waits for 2 minutes for the public site to finish the deployment to Cloudflare Pages. It then runs the Google Lighthouse performance tests. Grabs the data and populates it in a few locations. This includes a slack message as shown below. It updates the stats page on the blog. Plus a full detailed report is available in GitHub. The full report is approximately 18MB and is available for 30 days.\n\n![](https://jameskilby.co.uk/wp-content/uploads/2026/01/Slack-Lighthouse-Perfomance.png)\n\nLighthouse measures the following metrics\n\n  * Performance Score\n  * Accessibility Score\n  * Best Practices Score\n  * SEO Score\n  * First Contentful Paint (FCP)\n  * Largest Contentful Paint (LCP)\n  * Time to Interactive (TTI)\n  * Cumulative Layout Shift (CLS)\n\nOnce you have a sensible baseline for your site you can start optimising it using the included recommendations. Below I have listed some of the improvements I have made.\n\n### Site Performance Improvements\n\n#### Brotli Compression\n\nBrotli is a modern compression algorithm and can achieve better compression ratio’s than gzip, therefore it makes it a good candidate for modern websites. This especially true for mobile devices where connection speed can be constrained. Brotli typically gets an extra 15-25% compression above what gzip can offer. \n\nI have added a step to the deployment runner to compress the static files with Brotli I.e. html, css and javascript etc. This produced some significant space savings: The below stats are taken from the last run.\n    \n    \n    Original size: 6,894,868 bytes (6.58 MB)\n    \n     Compressed size: 1,193,382 bytes (1.14 MB)\n    \n     Space saved: 5,701,486 bytes (5.44 MB)\n    \n     Average compression: 82.7%\n\n📋 Copy\n\nThe job is setup to compress the files and upload both the Brotli compressed files and the standard ones. Cloudflare will serve Brotli assuming the end client supports it or fallback to legacy if needed for outdated browsers.\n\n#### Local Font Hosting\n\nPrior to this change I was using [Google fonts](https://fonts.google.com) however In my aim to be more privacy focused and also improve the site performance the deployment job now swaps these out for local fonts (served from the jameskilby.co.uk domain within Cloudflare) This means that less DNS lookups are required for the site and Google is not aware of site visits from analysing requests for fonts. \n\n#### Lazy Loading\n\nLazy loading is applied to the images on the page “below the fold” This allowed for anything that needed scrolling to be viewed to be loaded in the background.\n\n#### DNS Prefetch and Connection\n\nMost of the website content resides on jameskilby.co.uk served directly from Cloudflare however the analytics run by plausible is on a separate domain plausible.jameskilby.com. This resides on a dedicated VM in my lab.\n\nI have created a step in the deployment workflow to DNS prefetch for plausible.jameskilby.cloud and preconnect for plausible.jameskilby.cloud\n\nI have also made this an async connection so that the loading of the stats doesn’t impact the site loading performance. This change had to be excluded from the Cloudflare Rocket processing using data-cfasync=”false” \n\n#### Extract inline CSS to external file\n\nDoing this reduces the size of the individual HTML files. Rather than having all of the CSS in every HTML file the CSS is split out into a dedicated file. This also allows the CSS file to be reutilised.\n\n#### Image Optimisation\n\nI have added steps to optimise the images on the site using AVIF. I then have a script to modify the WordPress HTML Image element with a picture element. This enables serving multiple file types where the source browser can choose. AVIF has good modern support and excellent compression ratio’s. However it makes sense to have a backup available just incase. One of the downside’s of the AVIF format is the encoding can be quite slow. However the workflow creates a MD5 of the source images and creates a cache and therefore will only optimise new or changed images. This took a long time to get right that were mainly down to ordering problems in the execution.\n\n#### Favicon\n\nOne of the steps I did during optimisation is provide one of my AI [tools ](https://jameskilby.co.uk/2025/04/warp-the-intelligent-terminal/)the har file of my site. I then asked it to suggest recommendations. One of them was that the Favicon was very large. Initially I did not understand this. On further digging it correctly identified that the issue is that /favicon.ico is returning the full HTML homepage instead of an actual icon file! This is a Cloudflare Pages configuration issue. As Cloudflare will serve the homepage rather than a 404 error message. It then helped me create an optimised version from the logo that was 1.6KB rather than 200+ KB that was initially being served.\n\n### GitHub Runner Performance Improvements\n\nI have made a number of changes in the runner that GitHub executes the deployment. Some of these are to improve the performance of the deployment run as it had got quite lengthy. At its worst it was taking 24 minutes to fully execute. However with the below changes, this has been brought down to approximately 3-4 minutes. This is despite the fact that additional steps have been added.\n\n## Incremental Build\n\nThe Incremental build step stores metadata about posts, pages, and assets   \nthis includes hashes of the content the last modified time and the last build timestamps  \nWhen querying the WordPress API for changes it uses the modified_after parameter to fetch only content changed since the last build before building the site.\n\n  1. \n\n## Secret Scanning\n\nAs the site is basically in GitOps fashion. I decided to add some best practices into the workflow. One of them is “Secret Scanning”. This is implemented in two places. \n\n### Pre-Commit\n\nThe first part is done as a pre-commit this stops me committing anything classed as a secret into the repo in the first place.\n\n### Github Action\n\nThis action scans entire repository history for secrets and sends a slack alert if a secret is found.\n\nI created a test file and checked it in to Git\n    \n    \n    # Test configuration file for secret scanning workflow\n    # This file contains a FAKE secret for testing purposes only\n    \n    # Fake API Key (for testing secret detection)\n    API_KEY=sk_test_51ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnop1234567890\n    \n    # Fake AWS Access Key (for testing)\n    AWS_ACCESS_KEY_ID=AKIAIOSFODNN7EXAMPLE\n    \n    # Fake GitHub Token (for testing)\n    GITHUB_TOKEN=ghp_1234567890abcdefghijklmnopqrstuvwxyzABCD\n    \n    # Fake Database Password (for testing)\n    DATABASE_PASSWORD=super_secret_password_123456\n    \n    # Note: These are all FAKE credentials for testing the secret scanning workflow\n    # They are not real and cannot be used to access any actual services\n    \n\n📋 Copy\n\n![](https://jameskilby.co.uk/wp-content/uploads/2026/01/Secret-Scanning-Slack-Alert-1024x396.png)\n\nI have configured the gitleaks.toml to exclude the “public” folder within the repo as I may show example usernames/passwords in blogposts.\n\n## Content Improvements\n\nBelow are some of the changes that I have introduced that are visible to site users.\n\n### Freshness Indicator\n\nThe deployment wizard also adds a freshness indicator to each page\n\nIe (Published: January 06, 2018, Updated: July 10, 2024) This is injected at the top of the page, it is only injected if there have been multiple versions of the site.\n\n### Removes WordPress footer fluff\n\nAnything not needed for the static site is removed. \n\n### Copy Buttons\n\nFor every code block on the site a copy function is injected as seen below\n    \n    \n    Example Code Block\n\n📋 Copy\n\n### Theme Injection\n\nThe WordPress theme I’m running on the authoring site is just a vanilla site. The runner updates the CSS/theme at build time inspired from <https://justfuckingusecloudflare.com>\n\n#### SEO\n\nTo help with the SEO the runner builds at execution:\n\n  * Sitemap Generator\n  * RSS Feed\n  * Robots.txt\n  * Security header\n\n## Markdown\n\nThe last thing the runner has been configured to do is to create a Markdown version of each post. In the AI world we are living in this makes sense for them to consume in this function. A step is also included to create a link to the Markdown version at the very bottom of each page.\n\n## Change Log and Stats\n\nLastly we generate the two public pages to give visibility on the above.\n\n<https://jameskilby.co.uk/stats>\n\n[https://jameskilby.co.uk/change](https://jameskilby.co.uk/changelog)\n\n## 📚 Related Posts\n\n  * [How I upgraded my blog as a Static Website with GitHub Actions and Cloudflare](https://jameskilby.co.uk/2025/10/how-i-deploy-my-blog-as-a-static-website-with-github-actions-and-cloudflare/)\n  * [WordPress Hosting with Cloudflare Pages](https://jameskilby.co.uk/2023/05/how-to-take-a-wordpress-site-and-publish-it-as-a-static-site-on-cloudflare-pages/)\n  * [Static WordPress hosting using Cloudflare](https://jameskilby.co.uk/2022/10/how-i-moved-my-wordpress-site-to-cloudflare-pages/)\n\n## Similar Posts\n\n  * [ ![Static WordPress hosting using Cloudflare](https://jameskilby.co.uk/wp-content/uploads/2022/10/iu-768x450.jpeg) ](https://jameskilby.co.uk/2022/10/how-i-moved-my-wordpress-site-to-cloudflare-pages/)\n\n[Cloudflare](https://jameskilby.co.uk/category/cloudflare/) | [Hosting](https://jameskilby.co.uk/category/hosting/) | [Wordpress](https://jameskilby.co.uk/category/wordpress/)\n\n### [Static WordPress hosting using Cloudflare](https://jameskilby.co.uk/2022/10/how-i-moved-my-wordpress-site-to-cloudflare-pages/)\n\nBy[James](https://jameskilby.co.uk) October 20, 2022December 27, 2025\n\nFor a while now I have been running this site directly from Cloudflare utilising their excellent worker’s product. I did this originally as a learning exercise but due to the benefits It brought and the ease of use I decided to stick with it. The benefits are several fold: Crazy Web Performance (Typically full page…\n\n  * [ ![Wrangler and Node versions](https://jameskilby.co.uk/wp-content/uploads/2022/01/WranglerCrab-1-768x256.png) ](https://jameskilby.co.uk/2022/01/wrangler-and-node-versions/)\n\n[Cloudflare](https://jameskilby.co.uk/category/cloudflare/)\n\n### [Wrangler and Node versions](https://jameskilby.co.uk/2022/01/wrangler-and-node-versions/)\n\nBy[James](https://jameskilby.co.uk) January 15, 2022April 10, 2023\n\nI am a massive fan of the brew package management system for macOS and use it on all of my Mac’s I typically just upgrade everything blindly and have never had an issue….. Until today… I went to push some changes to this site and got the following error message A quick bit of digging…\n\n  * [ ![Cloudflare Workers – Limits of the free tier](https://jameskilby.co.uk/wp-content/uploads/2022/10/iu-768x450.jpeg) ](https://jameskilby.co.uk/2022/01/cloudflare-workers-limits-of-the-free-tier/)\n\n[Hosting](https://jameskilby.co.uk/category/hosting/) | [Wordpress](https://jameskilby.co.uk/category/wordpress/)\n\n### [Cloudflare Workers – Limits of the free tier](https://jameskilby.co.uk/2022/01/cloudflare-workers-limits-of-the-free-tier/)\n\nBy[James](https://jameskilby.co.uk) January 4, 2022April 9, 2023\n\nI have been making several changes (mainly cosmetic to this site over the last day or so) On most changes I have been doing an export and then uploading the site to Cloudflare using Wrangler. After a while I received an email from Cloudflare saying: Hi, You’re 50% of the way to reaching one of…\n\n  * [ ![How I Migrated from Pocket to Hoarder with AI Integration](https://jameskilby.co.uk/wp-content/uploads/2025/01/Screenshot-2025-01-29-at-23.30.47-768x411.png) ](https://jameskilby.co.uk/2025/01/how-i-migrated-from-pocket-to-hoarder-and-introduced-some-ai-along-the-way/)\n\n[Artificial Intelligence](https://jameskilby.co.uk/category/artificial-intelligence/) | [Docker](https://jameskilby.co.uk/category/docker/) | [Hosting](https://jameskilby.co.uk/category/hosting/)\n\n### [How I Migrated from Pocket to Hoarder with AI Integration](https://jameskilby.co.uk/2025/01/how-i-migrated-from-pocket-to-hoarder-and-introduced-some-ai-along-the-way/)\n\nBy[James](https://jameskilby.co.uk) January 29, 2025January 18, 2026\n\nUpdate: Hoarder has now been renamed to Karakeep due to a trademark issue I’ve been on a mission recently to regain control of my data. I haven’t yet faced the humongous task of moving my main email from Gmail, but I have had some successes with other cloud services and a win is a win…….\n\n  * [ ![Web Development](https://jameskilby.co.uk/wp-content/uploads/2020/06/iu-2-768x229.png) ](https://jameskilby.co.uk/2022/01/web-development/)\n\n[Hosting](https://jameskilby.co.uk/category/hosting/) | [Cloudflare](https://jameskilby.co.uk/category/cloudflare/) | [Personal](https://jameskilby.co.uk/category/personal/) | [Wordpress](https://jameskilby.co.uk/category/wordpress/)\n\n### [Web Development](https://jameskilby.co.uk/2022/01/web-development/)\n\nBy[James](https://jameskilby.co.uk) January 4, 2022October 1, 2025\n\nA while ago I started messing with Cloudflare Workers. I have now moved this site permanently over to them. This is partly related to some issues I have been having with internet access at home. Prior to this, the site ran from within my lab. This means the site is now super fast (hopefully :p)….\n\n  * [ ![WordPress Hosting with Cloudflare  Pages](https://jameskilby.co.uk/wp-content/uploads/2023/05/simply-static-logo.png) ](https://jameskilby.co.uk/2023/05/how-to-take-a-wordpress-site-and-publish-it-as-a-static-site-on-cloudflare-pages/)\n\n[Cloudflare](https://jameskilby.co.uk/category/cloudflare/) | [Hosting](https://jameskilby.co.uk/category/hosting/) | [Wordpress](https://jameskilby.co.uk/category/wordpress/)\n\n### [WordPress Hosting with Cloudflare Pages](https://jameskilby.co.uk/2023/05/how-to-take-a-wordpress-site-and-publish-it-as-a-static-site-on-cloudflare-pages/)\n\nBy[James](https://jameskilby.co.uk) May 14, 2023October 1, 2025\n\nTable of Contents The Tooling The Process WordPress Plugin Install GitHub setup Cloudflare setup I have been using Cloudflare to protect my web assets for a really long time. Throughout that time Cloudflare has been improving there capabilities and approximately 2 years ago I decided to move this blog into their worker’s product. This meant…",
  "excerpt": "![](https://jameskilby.co.uk/wp-content/uploads/2026/01/Website-Optimisations.png)\n\n[Cloudflare](https://jameskilby.co.uk/category/cloudflare/) | [Hosting](https://jameskilby.co.uk/category/hosting/) | [Wordpress](https://jameskilby.co.uk/category/wordpress/)\n\n# Web Development Improvements\n\nBy[Jame..."
}